GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p16F18013.inc
;-----Bank34------------------
DAC1CON          EQU  H'110C'
DAC1DATL         EQU  H'110D'

;-----Bank57------------------
NVMADR           EQU  H'1C8C'
NVMADRL          EQU  H'1C8C'
NVMADRH          EQU  H'1C8D'
NVMDAT           EQU  H'1C8E'
NVMDATL          EQU  H'1C8E'
NVMDATH          EQU  H'1C8F'
NVMCON1          EQU  H'1C90'
NVMCON2          EQU  H'1C91'

;-----Bank58------------------
ADLTH            EQU  H'1D0C'
ADLTHL           EQU  H'1D0C'
ADLTHH           EQU  H'1D0D'
ADUTH            EQU  H'1D0E'
ADUTHL           EQU  H'1D0E'
ADUTHH           EQU  H'1D0F'
ADERR            EQU  H'1D10'
ADERRL           EQU  H'1D10'
ADERRH           EQU  H'1D11'
ADSTPT           EQU  H'1D12'
ADSTPTL          EQU  H'1D12'
ADSTPTH          EQU  H'1D13'
ADFLTR           EQU  H'1D14'
ADFLTRL          EQU  H'1D14'
ADFLTRH          EQU  H'1D15'
ADACC            EQU  H'1D16'
ADACCL           EQU  H'1D16'
ADACCH           EQU  H'1D17'
ADACCU           EQU  H'1D18'
ADCNT            EQU  H'1D19'
ADRPT            EQU  H'1D1A'
ADPREV           EQU  H'1D1B'
ADPREVL          EQU  H'1D1B'
ADPREVH          EQU  H'1D1C'
ADRES            EQU  H'1D1D'
ADRESL           EQU  H'1D1D'
ADRESH           EQU  H'1D1E'
ADPCH            EQU  H'1D1F'
ADACQ            EQU  H'1D21'
ADACQL           EQU  H'1D21'
ADACQH           EQU  H'1D22'
ADCAP            EQU  H'1D23'
ADPRE            EQU  H'1D24'
ADPREL           EQU  H'1D24'
ADPREH           EQU  H'1D25'
ADCON0           EQU  H'1D26'
ADCON1           EQU  H'1D27'
ADCON2           EQU  H'1D28'
ADCON3           EQU  H'1D29'
ADSTAT           EQU  H'1D2A'
ADREF            EQU  H'1D2B'
ADACT            EQU  H'1D2C'
ADCLK            EQU  H'1D2D'
ADCG1A           EQU  H'1D2E'

;-----Bank59------------------
RA0PPS           EQU  H'1D8C'
RA1PPS           EQU  H'1D8D'
RA2PPS           EQU  H'1D8E'
RA4PPS           EQU  H'1D90'
RA5PPS           EQU  H'1D91'

;-----Bank60------------------
PPSLOCK          EQU  H'1E0C'
INTPPS           EQU  H'1E0D'
T0CKIPPS         EQU  H'1E0E'
T1CKIPPS         EQU  H'1E0F'
T1GPPS           EQU  H'1E10'
T3CKIPPS         EQU  H'1E11'
T3GPPS           EQU  H'1E12'
T2INPPS          EQU  H'1E19'
T4INPPS          EQU  H'1E1A'
T6INPPS          EQU  H'1E1B'
CCP1PPS          EQU  H'1E1E'
CCP2PPS          EQU  H'1E1F'
CLCIN0PPS        EQU  H'1E3D'
CLCIN1PPS        EQU  H'1E3E'
CLCIN2PPS        EQU  H'1E3F'
CLCIN3PPS        EQU  H'1E40'
RX1PPS           EQU  H'1E41'
RX1DTPPS         EQU  H'1E41'
CK1PPS           EQU  H'1E42'
TX1CKPPS         EQU  H'1E42'

;-----Bank61------------------
SSP1CLKPPS       EQU  H'1E47'
SSP1DATPPS       EQU  H'1E48'
SSP1SSPPS        EQU  H'1E49'
ADACTPPS         EQU  H'1E50'
ANSELA           EQU  H'1E8C'
WPUA             EQU  H'1E8D'
ODCONA           EQU  H'1E8E'
SLRCONA          EQU  H'1E8F'
INLVLA           EQU  H'1E90'
IOCAP            EQU  H'1E91'
IOCAN            EQU  H'1E92'
IOCAF            EQU  H'1E93'

;-----Bank62------------------
RA1I2C           EQU  H'1EE1'
RA2I2C           EQU  H'1EE2'
UMTOAP           EQU  H'1F0C'
UMTOAL           EQU  H'1F0D'
UMTOAH           EQU  H'1F0E'

;-----Bank64------------------
STATUS_SHAD      EQU  H'1FE4'
WREG_SHAD        EQU  H'1FE5'
BSR_SHAD         EQU  H'1FE6'
PCLATH_SHAD      EQU  H'1FE7'
FSR0_SHAD        EQU  H'1FE8'
FSR0L_SHAD       EQU  H'1FE8'
FSR0H_SHAD       EQU  H'1FE9'
FSR1_SHAD        EQU  H'1FEA'
FSR1L_SHAD       EQU  H'1FEA'
FSR1H_SHAD       EQU  H'1FEB'
STKPTR           EQU  H'1FED'
TOSL             EQU  H'1FEE'
TOSH             EQU  H'1FEF'


;----- STATUS Bits -----------------------------------------------------
C                EQU  H'0000'
DC               EQU  H'0001'
Z                EQU  H'0002'
NPD              EQU  H'0003'
NTO              EQU  H'0004'
CARRY            EQU  H'0000'
ZERO             EQU  H'0002'


;----- BSR Bits -----------------------------------------------------
BSR0             EQU  H'0000'
BSR1             EQU  H'0001'
BSR2             EQU  H'0002'
BSR3             EQU  H'0003'
BSR4             EQU  H'0004'
BSR5             EQU  H'0005'


;----- INTCON Bits -----------------------------------------------------
INTEDG           EQU  H'0000'
PEIE             EQU  H'0006'
GIE              EQU  H'0007'


;----- PORTA Bits -----------------------------------------------------
RA0              EQU  H'0000'
RA1              EQU  H'0001'
RA2              EQU  H'0002'
RA3              EQU  H'0003'
RA4              EQU  H'0004'
RA5              EQU  H'0005'


;----- TRISA Bits -----------------------------------------------------
TRISA0           EQU  H'0000'
TRISA1           EQU  H'0001'
TRISA2           EQU  H'0002'
TRISA4           EQU  H'0004'
TRISA5           EQU  H'0005'


;----- LATA Bits -----------------------------------------------------
LATA0            EQU  H'0000'
LATA1            EQU  H'0001'
LATA2            EQU  H'0002'
LATA4            EQU  H'0004'
LATA5            EQU  H'0005'


;----- PIR0 Bits -----------------------------------------------------
INTF             EQU  H'0000'
IOCIF            EQU  H'0004'
TMR0IF           EQU  H'0005'


;----- PIR1 Bits -----------------------------------------------------
NVMIF            EQU  H'0000'
ACTIF            EQU  H'0002'
TMR1IF           EQU  H'0003'
TMR1GIF          EQU  H'0004'
TMR3IF           EQU  H'0005'
TMR3GIF          EQU  H'0006'
TMR2IF           EQU  H'0007'


;----- PIR2 Bits -----------------------------------------------------
TMR4IF           EQU  H'0000'
TMR6IF           EQU  H'0001'
CCP1IF           EQU  H'0002'
CCP2IF           EQU  H'0003'
NCO1IF           EQU  H'0004'
CLC1IF           EQU  H'0006'
CLC2IF           EQU  H'0007'


;----- PIR3 Bits -----------------------------------------------------
CLC3IF           EQU  H'0000'
CLC4IF           EQU  H'0001'
TX1IF            EQU  H'0002'
RC1IF            EQU  H'0003'
SSP1IF           EQU  H'0006'
BCL1IF           EQU  H'0007'


;----- PIR4 Bits -----------------------------------------------------
CM1IF            EQU  H'0002'
ADIF             EQU  H'0003'
ADTIF            EQU  H'0004'
ZCDIF            EQU  H'0005'


